Repository: peterelia22/Aman-24
Catalog: lib/l10n/intl_*.arb
Languages: ar

# greeting
source: Hello
ar: مرحباً

# reportButtonTitle
source: Submit new report
ar: تقديم بلاغ جديد

# reportButtonDiscription
source: You can submit a new report
ar: يمكنك تقديم بلاغ جديد

# reportButtonDiscriptionContinue
source: easily and quickly
ar: بسهولة وسرعة

source: Quick options
ar: خيارات سريعة

source: My Reports
ar: بلاغاتي

source: Security Tips
ar: نصائح أمنية

source: Emergency Numbers
ar: أرقام الطوارئ

source: Ministry Awareness
ar: توعية الوزارة

source: Cyber Fraud Warning
ar: تحذير من الاحتيال الإلكتروني

# cyberFraudWarningContinue
source: Protect yourself from cybercrime,
ar: احمِ نفسك من الجرائم الإلكترونية

# cyberFraudWarningContinue2
source: fraud, and threats
ar: والاحتيال والتهديدات

source: Reporting Cybercrimes
ar: التبليغ عن الجرائم الالكترونيه

# cyberFraudWarningContinue3
source: Report cybercrimes and cyber fraud
ar: بلّغ عن الجرائم والاحتيال الإلكتروني

# cyberFraudWarningContinue4
source: to protect yourself
ar: الإلكتروني لحماية نفسك

source: Submit Report
ar: تقديم بلاغ

source: Report Title
ar: عنوان البلاغ

source: Home
ar: الرئيسية

source: Notifications
ar: الإشعارات

source: Profile
ar: الملف الشخصي

source: Email
ar: البريد الإلكتروني

source: Phone Number
ar: رقم الهاتف

source: National ID
ar: الرقم القومي

source: Language
ar: اللغة

# themeMode
source: Theme
ar: الوضع

source: Light Mode
ar: الوضع الفاتح

source: Dark Mode
ar: الوضع الداكن

source: Logout
ar: تسجيل الخروج

# noNotfi
source: There are no notifications at the moment.
ar: لا توجد إشعارات في الوقت الحالي.

# noReports
source: There are no reports from this user
ar: لا توجد بلاغات لهذا المستخدم.

# errorWhileLouding
source: Error While Loading
ar: خطأ أثناء التحميل

source: Loading...
ar: جاري التحميل...

# tip1
source: Enable two-factor authentication (2FA) to protect your accounts from hacking.
ar: قم بتفعيل المصادقة الثنائية (2FA) لحماية حساباتك من الاختراق.

# tip2
source: Avoid clicking on suspicious links or links sent from untrusted sources.
ar: تجنّب الضغط على الروابط المشبوهة أو المرسلة من مصادر غير موثوقة.

# tip3
source: Make sure that the websites you visit begin with HTTPS before entering any sensitive data.
ar: تأكد من أن المواقع التي تزورها تبدأ بـ HTTPS قبل إدخال أي بيانات حساسة.

# tip4
source: Use and regularly update security software to protect against viruses and hacks.
ar: استخدم برامج الحماية وقم بتحديثها بانتظام للحماية من الفيروسات والاختراق.

# tip5
source: Use a reliable VPN when connecting to public or open networks.
ar: استخدم شبكة VPN موثوقة عند الاتصال بشبكات عامة أو مفتوحة.

# tip6
source: Choose strong and long passwords and do not use the same password for more than one account.
ar: اختر كلمات مرور قوية وطويلة ولا تستخدم نفس كلمة المرور لأكثر من حساب.

# tip7
source: Keep backups of your important data in a safe place.
ar: احتفظ بنسخ احتياطية من بياناتك المهمة في مكان آمن.

# tip8
source: Report any attempted fraud or cyber threat immediately.
ar: بلّغ فوراً عن أي محاولة احتيال أو تهديد إلكتروني.

# tip9
source: Avoid conducting financial transactions over public Wi-Fi networks.
ar: تجنّب إجراء المعاملات المالية عبر شبكات الواي فاي العامة.

# tip10
source: Update your operating system and applications to avoid security vulnerabilities.
ar: قم بتحديث نظام التشغيل والتطبيقات لتجنب الثغرات الأمنية.

# usingEmergencyNumbers
source: Please use these numbers only in actual emergencies.
ar: يرجى استخدام هذه الأرقام فقط في حالات الطوارئ الحقيقية.

source: Ambulance
ar: الإسعاف

source: Police
ar: الشرطة

source: Fire Fighters
ar: الإطفاء

source: HelpLine
ar: خط المساعدة

source: Electrical emergency
ar: طوارئ الكهرباء

source: Fire emergency
ar: طوارئ الحريق

source: Water
ar: المياه

source: Enter Report Title
ar: ادخل عنوان البلاغ

# reportTitleAtLeast5
source: Report title should be at least 5 letters
ar: عنوان البلاغ يجب ان يكون علي الاقل 5 احرف

# reportEx
source: Example: Robbing a store
ar: مثال: سرقة محل تجاري

source: Enter report description
ar: ادخل وصف للبلاغ

# reportDescriptionAtLeast10
source: Report description should be at least 10 characters
ar: وصف البلاغ يجب ان يكون علي الاقل 10 احرف

source: Report Description
ar: وصف البلاغ

source: Write report description
ar: اكتب تفاصيل البلاغ

# location
source: Location (Optional)
ar: الموقع (اختياري)

# locationEx
source: Example: Downtown, Cairo
ar: مثال: شارع الجمهورية

# photosAndVideos
source: Photos & Videos
ar: الصور والفيديوهات

# addPhotosAndVideos
source: Tap the icons to add media
ar: اضغط على الأيقونات لإضافة الوسائط

source: Alert!
ar: تنبيه

# mustAddMedia
source: You should add at least one photo or video
ar: يجب اضافة صورة واحده او فيديو علي الاقل

# sendingReport
source: Send Report
ar: ارسال بلاغ

source: Adding Photo
ar: اضافة صورة

source: Adding Video
ar: اضافة فيديو

source: Sign in
ar: تسجيل الدخول

# signInSuccess
source: Signed in successfully
ar: تم تسجيل الدخول بنجاح

# notSignedIn
source: Didn't sign in
ar: لم يتم تسجيل الدخول

# passwardResetSuccessfully
source: A password reset link has been sent to your email address.
ar: تم إرسال رابط إعادة تعيين كلمة المرور إلى بريدك الإلكتروني

source: Reset Password
ar: إعادة تعيين كلمة المرور

# sendingEmailForNewPassword
source: Enter your email address or national ID number and we will send you a link to reset your password.
ar: أدخل عنوان بريدك الإلكتروني أو الرقم القومي وسنرسل لك رابطًا لإعادة تعيين كلمة المرور الخاصة بك.

# enterEmailOrId
source: Please enter your email address or national ID number.
ar: الرجاء إدخال عنوان بريدك الإلكتروني أو الرقم القومي.

# validEmailOrId
source: Please enter a valid email address or a valid national ID number.
ar: الرجاء إدخال عنوان بريد إلكتروني صالح أو رقم قومي صالح.

# emailOrId
source: Email or National ID
ar: البريد الإلكتروني أو الرقم القومي

# sendingLinkReset
source: Sending Reset Link
ar: ارسال رابط لإعادة التعيين

# backSignIn
source: Back to Sign In
ar: العودة لتسجيل الدخول

# signupFailed
source: Signup has failed
ar: فشل إنشاء الحساب

# fristName
source: First Name
ar: الاسم الأول

# fristNameEx
source: Eddard
ar: محمد

source: Last Name
ar: الاسم الاخير

# lastNameEx
source: Stark
ar: طنطاوي

# enterNationalId
source: Please enter your national ID
ar: رجاء ادخل الرقم القومي

# nationalIdOnlyNums
source: National ID must contain only numbers
ar: يجب ان يكون الرقم القومي الأرقام فقط

# nationalIdAtleastNums
source: National ID must be exactly 14 digits
ar: يجب ان يكون الرقم القومي 14 رقم فقط

# enterPhone
source: Enter Phone Number
ar: ادخل رقم الهاتف

# phoneNumberOnlyNums
source: Phone number must contain only numbers
ar: رقم االهاتف يجب ان يكون مكون من ارقام فقط

# phoneNumber11
source: Phone number must be 11 digits
ar: رقم الهاتف يجب ان يتكون من 11 رقما

source: Creating Account
ar: انشاء حساب

# havingAccount
source: Do you have an account?
ar: هل لديك حساب ؟

source: Call Now
ar: اتصل الان

source: Do you want to call
ar: هل تريد الاتصال ب

# enteringPassword
source: Please enter password
ar: رجاء ادخل كلمة المرور

source: Password
ar: كلمة المرور

# forgetPassword
source: Forgot your password?
ar: هل نسيت كلمة السر

# do_notHaveAccount
source: Don't have an account?
ar: ليس لديك حساب

source: Report Details
ar: تفاصيل البلاغ

source: Status
ar: الحالة

source: Description
ar: الوصف

source: Address
ar: الموقع

# media
source: Photos/Videos
ar: الصور/الفيديو

source: Admin Comment
ar: تعليق المسؤول

source: Report Date
ar: تاريخ البلاغ

# statusPending
source: Pending
ar: قيد المراجعة

# statusInReview
source: In Review
ar: تحت المراجعة

# statusInvestigating
source: Investigating
ar: جاري التحقيق

# statusResolved
source: Resolved
ar: تم الحل

# statusRejected
source: Rejected
ar: مرفوض

source: Report Status Updated
ar: تم تحديث حالة البلاغ

# reportStatusChangedTo
source: Your report status has been changed to
ar: تم تغيير حالة البلاغ الخاص بك إلى

source: Now
ar: الآن

source: since
ar: منذ

source: minute
ar: دقيقة

source: minutes
ar: دقائق

source: hour
ar: ساعة

source: hours
ar: ساعات

source: day
ar: يوم

source: days
ar: أيام

source: Choose Language
ar: اختر اللغة

source: Arabic
ar: العربية

source: Error
ar: خطأ

source: Failed to pick images
ar: فشل في اختيار الصور

source: Failed to pick video
ar: فشل في اختيار الفيديو

source: Failed to upload media
ar: فشل في رفع الملف

source: Cloudinary upload failed
ar: فشل رفع الملف

source: Cloudinary API Error
ar: خطأ في API

# noSecureUrlFound
source: Upload successful but no valid secure_url found in response
ar: لم يتم العثور على رابط آمن

# networkOrApiError
source: Network or API error during Cloudinary upload
ar: خطأ في الشبكة أو API

# unexpectedError
source: An unexpected error occurred during Cloudinary upload
ar: حدث خطأ غير متوقع

# deleteAccountError
source: An error occurred while deleting the account. Please try again.
ar: حدث خطأ أثناء حذف الحساب. الرجاء المحاولة مرة أخرى.

source: Incorrect email or password.
ar: الرقم السري او البريد الإلكتروني غير صحيح.

# networkConnectionFailed
source: Network connection failed. Please check your internet connection.
ar: فشل الاتصال بالشبكة. الرجاء التحقق من اتصالك بالإنترنت.

# signInFailed
source: Sign in failed. Please check your credentials and try again.
ar: فشل تسجيل الدخول. الرجاء التحقق من البيانات والمحاولة مرة أخرى.

# unknownSignInError
source: An unknown error occurred during sign in. Please try again.
ar: حدث خطأ غير معروف أثناء تسجيل الدخول. الرجاء المحاولة مرة أخرى.

# weakPassword
source: The password is too weak.
ar: الرقم السري ضعيف جداً.

# emailAlreadyInUse
source: This email address is already in use.
ar: لقد تم استخدام هذا البريد الإلكتروني بالفعل.

# accountCreationFailed
source: Account creation failed. Please try again.
ar: لم يتم إنشاء الحساب بنجاح. الرجاء المحاولة مرة أخرى.

# unknownAccountCreationError
source: An unknown error occurred while creating the account. Please try again.
ar: حدث خطأ غير معروف أثناء إنشاء الحساب. الرجاء المحاولة مرة أخرى.

# signOutError
source: An error occurred during sign out. Please try again.
ar: حدث خطأ أثناء تسجيل الخروج. الرجاء المحاولة مرة أخرى.

# userNotFound
source: No account registered with this email address.
ar: لا يوجد حساب مسجل بهذا البريد الإلكتروني.

# invalidEmail
source: Invalid email address.
ar: البريد الإلكتروني غير صالح.

# passwordResetFailed
source: Failed to send password reset link.
ar: فشل إرسال رابط إعادة تعيين كلمة المرور.

# unknownError
source: An unknown error occurred. Please try again.
ar: حدث خطأ غير معروف. الرجاء المحاولة مرة أخرى.

# nationalIdExists
source: This national ID is already registered
ar: الرقم القومي مسجل بالفعل

# failedToAddReport
source: An error occurred while adding the report
ar: حدث خطأ أثناء إضافة البلاغ

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب

# errorCheckingNationalId
source: An error occurred while verifying the national ID
ar: حدث خطأ أثناء التحقق من الرقم القومي

source: Cannot fetch notifications
ar: لا يمكن جلب الإشعارات

source: Invalid notification ID
ar: معرف الإشعار غير صالح

source: Failed to update notification status
ar: تعذر تحديث حالة الإشعار

source: Report not found
ar: البلاغ غير موجود

source: Failed to load report data
ar: تعذر تحميل بيانات البلاغ

# userIdMissing
source: User ID is missing
ar: معرف المستخدم غير موجود

# failedToLoadUserReports
source: An error occurred while loading user reports
ar: حدث خطأ أثناء تحميل بلاغات المستخدم

# nationalIdNotRegistered
source: National ID not registered. Please check your data
ar: الرقم القومي غير مسجل. الرجاء التحقق من البيانات

# dataLookupError
source: An error occurred while looking up data
ar: حدث خطأ أثناء البحث عن البيانات

# nationalIdNotFoundForEmail
source: National ID not found for this email
ar: لم يتم العثور على الرقم القومي لهذا الإيميل

# errorRetrievingNationalId
source: An error occurred while retrieving national ID
ar: حدث خطأ أثناء استرجاع الرقم القومي
